; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v4 - type_1 ?v6 - type_2)
 	      (pred_3 ?v7 - object ?v6 - type_2)
	      (pred_4 ?v4 - type_1 ?v2 - type_3)
	      (pred_2 ?v4 - type_1 ?v7 - object ?v2 - type_3))

   (:action op_1
       :parameters  (?v4 - type_1 ?v3 ?v8 - type_2)
       :precondition (and  (pred_1 ?v4 ?v3))
       :effect (and  (pred_1 ?v4 ?v8)
		     (not (pred_1 ?v4 ?v3))))

   (:action op_2
       :parameters (?v4 - type_1 ?v1 - object ?v5 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_3 ?v1 ?v5) (pred_1 ?v4 ?v5) (pred_4 ?v4 ?v2))
       :effect (and (pred_2 ?v4 ?v1 ?v2)
		    (not (pred_3 ?v1 ?v5)) 
		    (not (pred_4 ?v4 ?v2))))

   (:action op_3
       :parameters (?v4 - type_1 ?v1 - object ?v5 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_2 ?v4 ?v1 ?v2) (pred_1 ?v4 ?v5))
       :effect (and (pred_3 ?v1 ?v5)
		    (pred_4 ?v4 ?v2)
		    (not (pred_2 ?v4 ?v1 ?v2)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_11 obj_13 - type_1
obj_05 obj_08 obj_10 obj_02 - type_3
obj_06 obj_09 obj_04 obj_01 - type_2
obj_03 obj_07 obj_12 obj_14 - object)
(:init
(pred_1 obj_11 obj_01)
(pred_4 obj_11 obj_05)
(pred_4 obj_11 obj_08)
(pred_1 obj_13 obj_06)
(pred_4 obj_13 obj_10)
(pred_4 obj_13 obj_02)
(pred_3 obj_03 obj_06)
(pred_3 obj_07 obj_04)
(pred_3 obj_12 obj_09)
(pred_3 obj_14 obj_09)
)
(:goal
(and
(pred_3 obj_03 obj_01)
(pred_3 obj_07 obj_06)
(pred_3 obj_12 obj_01)
(pred_3 obj_14 obj_06)
)
)

(:constraints
  (always (not (pred_1 obj_11 obj_04)))
)
)

; plan
1. (op_2 obj_13 obj_03 obj_06 obj_02)
   deleted: (pred_3 obj_03 obj_06) (pred_4 obj_13 obj_02)
   added: (pred_2 obj_13 obj_03 obj_02)
   goals met: 0 of 4
2. (op_1 obj_11 obj_01 obj_09)
   deleted: (pred_1 obj_11 obj_01)
   added: (pred_1 obj_11 obj_09)
   goals met: 0 of 4
3. (op_1 obj_13 obj_06 obj_01)
   deleted: (pred_1 obj_13 obj_06)
   added: (pred_1 obj_13 obj_01)
   goals met: 0 of 4
4. (op_2 obj_11 obj_14 obj_09 obj_08)
   deleted: (pred_3 obj_14 obj_09) (pred_4 obj_11 obj_08)
   added: (pred_2 obj_11 obj_14 obj_08)
   goals met: 0 of 4
5. (op_2 obj_11 obj_12 obj_09 obj_05)
   deleted: (pred_3 obj_12 obj_09) (pred_4 obj_11 obj_05)
   added: (pred_2 obj_11 obj_12 obj_05)
   goals met: 0 of 4
6. (op_3 obj_13 obj_03 obj_01 obj_02)
   deleted: (pred_2 obj_13 obj_03 obj_02)
   added: (pred_3 obj_03 obj_01) (pred_4 obj_13 obj_02)
   goals met: 1 of 4
7. (op_1 obj_11 obj_09 obj_06)
   deleted: (pred_1 obj_11 obj_09)
   added: (pred_1 obj_11 obj_06)
   goals met: 1 of 4
8. (op_1 obj_13 obj_01 obj_04)
   deleted: (pred_1 obj_13 obj_01)
   added: (pred_1 obj_13 obj_04)
   goals met: 1 of 4
9. (op_3 obj_11 obj_14 obj_06 obj_08)
   deleted: (pred_2 obj_11 obj_14 obj_08)
   added: (pred_3 obj_14 obj_06) (pred_4 obj_11 obj_08)
   goals met: 2 of 4
10. (op_1 obj_11 obj_06 obj_01)
   deleted: (pred_1 obj_11 obj_06)
   added: (pred_1 obj_11 obj_01)
   goals met: 2 of 4
11. (op_2 obj_13 obj_07 obj_04 obj_02)
   deleted: (pred_3 obj_07 obj_04) (pred_4 obj_13 obj_02)
   added: (pred_2 obj_13 obj_07 obj_02)
   goals met: 2 of 4
12. (op_1 obj_13 obj_04 obj_06)
   deleted: (pred_1 obj_13 obj_04)
   added: (pred_1 obj_13 obj_06)
   goals met: 2 of 4
13. (op_3 obj_11 obj_12 obj_01 obj_05)
   deleted: (pred_2 obj_11 obj_12 obj_05)
   added: (pred_3 obj_12 obj_01) (pred_4 obj_11 obj_05)
   goals met: 3 of 4
14. (op_3 obj_13 obj_07 obj_06 obj_02)
   deleted: (pred_2 obj_13 obj_07 obj_02)
   added: (pred_3 obj_07 obj_06) (pred_4 obj_13 obj_02)
   goals met: 4 of 4
